HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_OFF (1u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_OFF (2u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_OFF (3u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP100 */
#define IFX_ERAY_MSIC4_MSIP100_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP100 */
#define IFX_ERAY_MSIC4_MSIP100_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP100 */
#define IFX_ERAY_MSIC4_MSIP100_OFF (4u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP101 */
#define IFX_ERAY_MSIC4_MSIP101_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP101 */
#define IFX_ERAY_MSIC4_MSIP101_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP101 */
#define IFX_ERAY_MSIC4_MSIP101_OFF (5u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP102 */
#define IFX_ERAY_MSIC4_MSIP102_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP102 */
#define IFX_ERAY_MSIC4_MSIP102_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP102 */
#define IFX_ERAY_MSIC4_MSIP102_OFF (6u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP103 */
#define IFX_ERAY_MSIC4_MSIP103_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP103 */
#define IFX_ERAY_MSIC4_MSIP103_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP103 */
#define IFX_ERAY_MSIC4_MSIP103_OFF (7u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP104 */
#define IFX_ERAY_MSIC4_MSIP104_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP104 */
#define IFX_ERAY_MSIC4_MSIP104_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP104 */
#define IFX_ERAY_MSIC4_MSIP104_OFF (8u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP105 */
#define IFX_ERAY_MSIC4_MSIP105_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP105 */
#define IFX_ERAY_MSIC4_MSIP105_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP105 */
#define IFX_ERAY_MSIC4_MSIP105_OFF (9u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP106 */
#define IFX_ERAY_MSIC4_MSIP106_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP106 */
#define IFX_ERAY_MSIC4_MSIP106_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP106 */
#define IFX_ERAY_MSIC4_MSIP106_OFF (10u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP107 */
#define IFX_ERAY_MSIC4_MSIP107_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP107 */
#define IFX_ERAY_MSIC4_MSIP107_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP107 */
#define IFX_ERAY_MSIC4_MSIP107_OFF (11u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP108 */
#define IFX_ERAY_MSIC4_MSIP108_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP108 */
#define IFX_ERAY_MSIC4_MSIP108_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP108 */
#define IFX_ERAY_MSIC4_MSIP108_OFF (12u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP109 */
#define IFX_ERAY_MSIC4_MSIP109_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP109 */
#define IFX_ERAY_MSIC4_MSIP109_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP109 */
#define IFX_ERAY_MSIC4_MSIP109_OFF (13u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP110 */
#define IFX_ERAY_MSIC4_MSIP110_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP110 */
#define IFX_ERAY_MSIC4_MSIP110_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP110 */
#define IFX_ERAY_MSIC4_MSIP110_OFF (14u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP111 */
#define IFX_ERAY_MSIC4_MSIP111_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP111 */
#define IFX_ERAY_MSIC4_MSIP111_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP111 */
#define IFX_ERAY_MSIC4_MSIP111_OFF (15u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP112 */
#define IFX_ERAY_MSIC4_MSIP112_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP112 */
#define IFX_ERAY_MSIC4_MSIP112_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP112 */
#define IFX_ERAY_MSIC4_MSIP112_OFF (16u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP113 */
#define IFX_ERAY_MSIC4_MSIP113_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP113 */
#define IFX_ERAY_MSIC4_MSIP113_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP113 */
#define IFX_ERAY_MSIC4_MSIP113_OFF (17u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP114 */
#define IFX_ERAY_MSIC4_MSIP114_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP114 */
#define IFX_ERAY_MSIC4_MSIP114_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP114 */
#define IFX_ERAY_MSIC4_MSIP114_OFF (18u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_OFF (19u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_OFF (20u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_OFF (21u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_OFF (22u)

